# pandas means excel with steroids

In [1]:
import pandas as pd
import numpy as np

In [3]:
#creating a series 
labels = ['a','b','c']
my_list=[10,20,30]
arr= np.array(my_list)
d={'a':10,'b':20,'c':30}

In [4]:
#using list to make a pandas series.
pd.Series(data=my_list)

0    10
1    20
2    30
dtype: int64

In [5]:
type(my_list)

list

In [6]:
series=pd.Series(data=my_list)

In [7]:
type(series)

pandas.core.series.Series

In [8]:
pd.Series(data=my_list,index=labels)

a    10
b    20
c    30
dtype: int64

In [9]:
pd.Series(my_list,labels)

a    10
b    20
c    30
dtype: int64

In [10]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [11]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int32

In [12]:
#using a dictionary
pd.Series(d)

a    10
b    20
c    30
dtype: int64

#### data in series have a variety of object types

In [16]:
pd.Series(labels,my_list)

10    a
20    b
30    c
dtype: object

In [21]:
pd.Series([sum,len,max, min])

0    <built-in function sum>
1    <built-in function len>
2    <built-in function max>
3    <built-in function min>
dtype: object

In [22]:
ser1=pd.Series([1,2,3,4], index=['USA','Germany','India','nepal'])

In [23]:
ser1

USA        1
Germany    2
India      3
nepal      4
dtype: int64

In [24]:
ser1[0]

1

In [25]:
ser2=pd.Series([1,2,5,4], index=['USA','Germany','Italy','Japan'])
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [26]:
ser1+ser2

Germany    4.0
India      NaN
Italy      NaN
Japan      NaN
USA        2.0
nepal      NaN
dtype: float64

## DataFrames

In [27]:
from numpy.random import randn
np.random.seed(101)

In [32]:
df=pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])
df

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
C -1.005187 -0.741790  0.187125 -0.732845
D -1.382920  1.482495  0.961458 -2.141212
E  0.992573  1.192241 -1.046780  1.292765

### SELECTION and INDEXING

In [33]:
df['W']

A    0.386030
B    0.681209
C   -1.005187
D   -1.382920
E    0.992573
Name: W, dtype: float64

In [37]:
df[['W','X','Z']].head(2)

          W         X         Z
A  0.386030  2.084019  0.230336
B  0.681209  1.035125  1.939932

In [38]:
type(df)

pandas.core.frame.DataFrame

In [41]:
df['new']=df['W']+df['Y']

In [42]:
df

          W         X         Y         Z       new
A  0.386030  2.084019 -0.376519  0.230336  0.009512
B  0.681209  1.035125 -0.031160  1.939932  0.650049
C -1.005187 -0.741790  0.187125 -0.732845 -0.818062
D -1.382920  1.482495  0.961458 -2.141212 -0.421462
E  0.992573  1.192241 -1.046780  1.292765 -0.054206

In [47]:
#removing Column
df=df.drop('new',axis=1)

In [48]:
df

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
C -1.005187 -0.741790  0.187125 -0.732845
D -1.382920  1.482495  0.961458 -2.141212
E  0.992573  1.192241 -1.046780  1.292765

In [49]:
df.loc['A']#extracting columns by index labels

W    0.386030
X    2.084019
Y   -0.376519
Z    0.230336
Name: A, dtype: float64

In [51]:
df.iloc[2]#extracting columns name by index number.

W   -1.005187
X   -0.741790
Y    0.187125
Z   -0.732845
Name: C, dtype: float64

In [52]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  0.386030 -0.376519
B  0.681209 -0.031160

In [56]:
df[df>0]

          W         X         Y         Z
A  0.386030  2.084019       NaN  0.230336
B  0.681209  1.035125       NaN  1.939932
C       NaN       NaN  0.187125       NaN
D       NaN  1.482495  0.961458       NaN
E  0.992573  1.192241       NaN  1.292765

In [57]:
#checking only one column
df[df['W']>0]#returns only two values.

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
E  0.992573  1.192241 -1.046780  1.292765

In [58]:
df[df['W']>0]['Y'] # perfrom operation on the w column and where w is true, it will return the Y column.

A   -0.376519
B   -0.031160
E   -1.046780
Name: Y, dtype: float64

In [60]:
df[df['W']>0][['X','Y']]# passing a list

          X         Y
A  2.084019 -0.376519
B  1.035125 -0.031160
E  1.192241 -1.046780

In [62]:
df[(df['X']>0)&(df['Y']>0)]

         W         X         Y         Z
D -1.38292  1.482495  0.961458 -2.141212

In [63]:
df.reset_index()

  index         W         X         Y         Z
0     A  0.386030  2.084019 -0.376519  0.230336
1     B  0.681209  1.035125 -0.031160  1.939932
2     C -1.005187 -0.741790  0.187125 -0.732845
3     D -1.382920  1.482495  0.961458 -2.141212
4     E  0.992573  1.192241 -1.046780  1.292765

In [64]:
wen='CA DA FA GA HA'.split()

In [65]:
df['States']=wen

In [66]:
df

          W         X         Y         Z States
A  0.386030  2.084019 -0.376519  0.230336     CA
B  0.681209  1.035125 -0.031160  1.939932     DA
C -1.005187 -0.741790  0.187125 -0.732845     FA
D -1.382920  1.482495  0.961458 -2.141212     GA
E  0.992573  1.192241 -1.046780  1.292765     HA

In [70]:
#changing index
df.set_index('States',inplace=True)

In [71]:
df

               W         X         Y         Z
States
CA      0.386030  2.084019 -0.376519  0.230336
DA      0.681209  1.035125 -0.031160  1.939932
FA     -1.005187 -0.741790  0.187125 -0.732845
GA     -1.382920  1.482495  0.961458 -2.141212
HA      0.992573  1.192241 -1.046780  1.292765

In [74]:
df['W']

States
CA    0.386030
DA    0.681209
FA   -1.005187
GA   -1.382920
HA    0.992573
Name: W, dtype: float64

### new session

### multiindex and index hierarchy

In [2]:
import pandas as pd
import numpy as np

In [4]:
#Index Levels
outside=['G1','G1','G1','G2','G2','G2']
inside=[1,2,3,1,2,3]
hier_index=list(zip(outside,inside))
hier_index=pd.MultiIndex.from_tuples(hier_index)

In [5]:
hier_index

MultiIndex(levels=[[u'G1', u'G2'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [6]:
df=pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])
df

             A         B
G1 1  1.131443  0.325068
   2 -1.324165  0.293669
   3  0.051279  0.683121
G2 1 -0.634739 -1.467875
   2  1.289156  0.282017
   3  0.023361  0.053981

In [8]:
df.loc['G1'].loc[1]

A    1.131443
B    0.325068
Name: 1, dtype: float64

In [9]:
df.index.names=['Groups','Num']
df

                   A         B
Groups Num
G1     1    1.131443  0.325068
       2   -1.324165  0.293669
       3    0.051279  0.683121
G2     1   -0.634739 -1.467875
       2    1.289156  0.282017
       3    0.023361  0.053981

In [11]:
#Extracting a columns and rows
df.loc['G2'].loc[[1,2]]

            A         B
Num
1   -0.634739 -1.467875
2    1.289156  0.282017

In [12]:
df.loc['G2'].loc[2]['B']# extracting particular number instead of a data frame.

0.28201657278838177

In [13]:
df.xs(1,level='Num')#extract every having a index 1.

               A         B
Groups
G1      1.131443  0.325068
G2     -0.634739 -1.467875

In [14]:
df1=pd.DataFrame({'A':[1,2,np.nan],
                 'B':[5,np.nan,np.nan],
                 'C':[1,2,3]})

In [15]:
df1

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [18]:
#using a dropna method
df1.dropna(axis=0)

     A    B  C
0  1.0  5.0  1

In [19]:
#thresh arguement.
df1.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [22]:
df1=df1.fillna(value=10)

In [25]:
df1['A'].fillna(value=df1['A'].mean())

0     1.0
1     2.0
2    10.0
Name: A, dtype: float64

#### the group by methods

In [28]:
data={'Company':['google','google','microsoft','microsoft','facebook','facebook'],
     'Person':['sum','charlie','amy','vanessa','carl','sarah'],
      'Sales':[200,120,340,124,243,350]
     }
dframe=pd.DataFrame(data)
dframe

     Company   Person  Sales
0     google      sum    200
1     google  charlie    120
2  microsoft      amy    340
3  microsoft  vanessa    124
4   facebook     carl    243
5   facebook    sarah    350

In [31]:
new=dframe.groupby('Company')

In [32]:
new

In [33]:
new.mean()

           Sales
Company
facebook   296.5
google     160.0
microsoft  232.0

In [36]:
new.describe()

          Sales
          count   mean         std    min     25%    50%     75%    max
Company
facebook    2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
google      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
microsoft   2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [37]:
new.describe().transpose()

Company        facebook      google   microsoft
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [38]:
new.describe().transpose()['google']#shows result of only one column.

Sales  count      2.000000
       mean     160.000000
       std       56.568542
       min      120.000000
       25%      140.000000
       50%      160.000000
       75%      180.000000
       max      200.000000
Name: google, dtype: float64

### merging, joining and concatenating

In [39]:
mer=pd.DataFrame({'A':['A0','A1','A2','A3'],
                 'B':['B0','B1','B2','B3'],
                  'C':['C0','C1','C2','C3'],
                  'D':['D0','D1','D2','D3']
                 }, index=[0,1,2,3])

In [40]:
mer

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [41]:
mer2=pd.DataFrame({'A':['A4','A5','A6','A7'],
                 'B':['B4','B5','B6','B7'],
                  'C':['C4','C5','c6','C7'],
                  'D':['D4','D5','D6','D7']
                 }, index=[4,5,6,7])
mer2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  c6  D6
7  A7  B7  C7  D7

In [42]:
mer3=pd.DataFrame({'A':['A8','A9','A10','A11'],
                 'B':['B8','B9','B10','B11'],
                  'C':['C8','C9','C10','C11'],
                  'D':['D8','D9','D10','D11']
                 }, index=[8,9,10,11])
mer3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

#### Concatenation

In [43]:
pd.concat([mer,mer2,mer3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   c6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [44]:
pd.concat([mer,mer2,mer3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   c6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [45]:
left=pd.DataFrame({'key':['k0','k1','k2','k3'],
                   'A':['A0','A1','A2','A3'],
                   'B':['B0','B1','B2','B3']   
})
right=pd.DataFrame({'key':['k0','k1','k2','k3'],
                   'C':['C0','C1','C2','C3'],
                   'D':['D0','D1','D2','D3']})

In [46]:
left

    A   B key
0  A0  B0  k0
1  A1  B1  k1
2  A2  B2  k2
3  A3  B3  k3

In [47]:
right

    C   D key
0  C0  D0  k0
1  C1  D1  k1
2  C2  D2  k2
3  C3  D3  k3

In [48]:
pd.merge(left,right,how='inner',on='key')

    A   B key   C   D
0  A0  B0  k0  C0  D0
1  A1  B1  k1  C1  D1
2  A2  B2  k2  C2  D2
3  A3  B3  k3  C3  D3

In [49]:
left=pd.DataFrame({'key1':['k0','k1','k2','k3'],
                   'key2':['k0','k1','k2','k3'],
                   'A':['A0','A1','A2','A3'],
                   'B':['B0','B1','B2','B3']})
right=pd.DataFrame({'key1':['k0','k1','k2','k3'],
                    'key2':['k0','k1','k2','k3'],
                   'C':['C0','C1','C2','C3'],
                   'D':['D0','D1','D2','D3']})

In [50]:
right

    C   D key1 key2
0  C0  D0   k0   k0
1  C1  D1   k1   k1
2  C2  D2   k2   k2
3  C3  D3   k3   k3

In [51]:
left

    A   B key1 key2
0  A0  B0   k0   k0
1  A1  B1   k1   k1
2  A2  B2   k2   k2
3  A3  B3   k3   k3

In [54]:
pd.merge(left,right,on=['key1','key2'])

    A   B key1 key2   C   D
0  A0  B0   k0   k0  C0  D0
1  A1  B1   k1   k1  C1  D1
2  A2  B2   k2   k2  C2  D2
3  A3  B3   k3   k3  C3  D3

In [55]:
pd.merge(left,right,on='key1')

    A   B key1 key2_x   C   D key2_y
0  A0  B0   k0     k0  C0  D0     k0
1  A1  B1   k1     k1  C1  D1     k1
2  A2  B2   k2     k2  C2  D2     k2
3  A3  B3   k3     k3  C3  D3     k3

In [56]:
pd.merge(left,right,how='right',on=['key1','key2'])

    A   B key1 key2   C   D
0  A0  B0   k0   k0  C0  D0
1  A1  B1   k1   k1  C1  D1
2  A2  B2   k2   k2  C2  D2
3  A3  B3   k3   k3  C3  D3

In [57]:
pd.merge(left,right,how='left',on=['key1','key2'])

    A   B key1 key2   C   D
0  A0  B0   k0   k0  C0  D0
1  A1  B1   k1   k1  C1  D1
2  A2  B2   k2   k2  C2  D2
3  A3  B3   k3   k3  C3  D3

#### joining

In [59]:
left1=pd.DataFrame({'A':['A8','A9','A10','A11'],
                 'B':['B8','B9','B10','B11'],
                 }, index=['k0','k1','k2','k3'])
right1=pd.DataFrame({'C':['C8','C9','C10','C11'],
                  'D':['D8','D9','D10','D11']}, index=['k0','k1','k2','k4'])

In [60]:
left1

      A    B
k0   A8   B8
k1   A9   B9
k2  A10  B10
k3  A11  B11

In [61]:
right1

      C    D
k0   C8   D8
k1   C9   D9
k2  C10  D10
k4  C11  D11

In [62]:
left1.join(right1)#how argument is by default left

      A    B    C    D
k0   A8   B8   C8   D8
k1   A9   B9   C9   D9
k2  A10  B10  C10  D10
k3  A11  B11  NaN  NaN

In [65]:
left1.join(right1,how='right')#k3 is not viewing because it comes under left1 df

      A    B    C    D
k0   A8   B8   C8   D8
k1   A9   B9   C9   D9
k2  A10  B10  C10  D10
k4  NaN  NaN  C11  D11

In [66]:
left1.join(right1,how='inner')#excludes both the df

      A    B    C    D
k0   A8   B8   C8   D8
k1   A9   B9   C9   D9
k2  A10  B10  C10  D10

In [67]:
left1.join(right1,how='outer')#includes both the df

      A    B    C    D
k0   A8   B8   C8   D8
k1   A9   B9   C9   D9
k2  A10  B10  C10  D10
k3  A11  B11  NaN  NaN
k4  NaN  NaN  C11  D11

In [1]:
import pandas as pd

In [4]:
df=pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [5]:
#Info on unique values.
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [6]:
df['col2'].nunique()

3

In [7]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [8]:
df[df['col1']>2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [9]:
df[(df['col1']>2)&(df['col2']==444)]

   col1  col2 col3
3     4   444  xyz

In [10]:
#using apply() method
def times(x):
    return x*2

In [11]:
df['col2'].apply(times)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [13]:
df['col2'].apply(lambda x:x*3)

0    1332
1    1665
2    1998
3    1332
Name: col2, dtype: int64

In [14]:
df.drop('col1',axis=1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [15]:
df.drop(1,axis=0)

   col1  col2 col3
0     1   444  abc
2     3   666  ghi
3     4   444  xyz

In [16]:
df.columns

Index([u'col1', u'col2', u'col3'], dtype='object')

In [17]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [18]:
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [22]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [4]:
df1.pivot_table(values='D',index=['A','B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [2]:
data={'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
     'C':['x','y','x','y','x','y'],
     'D':[1,3,2,5,4,1]}
df1=pd.DataFrame(data)
df1

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

## Data input output

#### pandas can write and read to different types of file and we will do only four

###### these are CSV, HTML,EXCEL AND SQL

i know already how to deal with csv files.

In [1]:
import pandas as pd

In [4]:
df=pd.read_csv('example')

In [5]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [6]:
df.to_csv('my_output')

In [8]:
pd.read_csv('my_output')

TypeError: parser_f() got an unexpected keyword argument 'index'

#### reading and writing to excel files

In [11]:
pd.read_excel('Excel_Sample.xlsx',sheetname='Sheet1')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [13]:
df.to_excel('my_excel.xlsx',sheet_name='newsheet')


### HTML

In [15]:
data=pd.read_html('https://en.wikipedia.org/wiki/List_of_banks_in_India')

In [16]:
data

[                                   0            1                        2  \
 0                          Bank Name  Established              Headquarter
 1                          Axis Bank         1993      Mumbai, Maharashtra
 2                       Bandhan Bank         2014     Kolkata, West Bengal
 3               Catholic Syrian Bank         1920         Thrissur, Kerala
 4                    City Union Bank         1904    Thanjavur, Tamil Nadu
 5                           DCB Bank         1930      Mumbai, Maharashtra
 6                     Dhanlaxmi Bank         1927         Thrissur, Kerala
 7                       Federal Bank      1931-49            Kochi, Kerala
 8                          HDFC Bank         1994      Mumbai, Maharashtra
 9                         ICICI Bank         1994      Mumbai, Maharashtra
 10                     IndusInd Bank         1994      Mumbai, Maharashtra
 11                         IDFC Bank         2015      Mumbai, Maharashtra
 12                    Karnataka Bank         1924     Mangaluru, Karnataka
 13                  Karur Vysya Bank         1916        Karur, Tamil Nadu
 14               Kotak Mahindra Bank         2003      Mumbai, Maharashtra
 15                Lakshmi Vilas Bank         1926      Chennai, Tamil Nadu
 16                     Nainital Bank         1922    Nainital, Uttarakhand
 17                          RBL Bank         1943      Mumbai, Maharashtra
 18                 South Indian Bank         1929         Thrissur, Kerala
 19  Tamilnad Mercantile Bank Limited         1921  Thoothukudi, Tamil Nadu
 20         U.P Agro Corporation Bank         2013  Mainpuri, Uttar Pradesh
 21                          Yes Bank         2004      Mumbai, Maharashtra

            3                                   4  \
 0   Branches                            Revenues
 1       3304  ₹414.0925 billion (US$6.0 billion)
 2        840    ₹4,320.12 crore (US$630 million)
 3        426     ₹1,617.5 crore (US$240 million)
 4        NaN     ₹29.44 billion (US$430 million)
 5        NaN     ₹20.76 billion (US$300 million)
 6        NaN        ₹12 billion (US$170 million)
 7       1252     ₹97.59 billion (US$1.4 billion)
 8       4715     ₹816.02 billion (US$12 billion)
 9       4867     ₹736.60 billion (US$11 billion)
 10      1004    ₹185.77 billion (US$2.7 billion)
 11      100+    ₹85.327 billion (US$1.2 billion)
 12       807     ₹51.85 billion (US$750 million)
 13       668     ₹54.43 billion (US$790 million)
 14      1369    ₹211.76 billion (US$3.1 billion)
 15       565     ₹25.68 billion (US$370 million)
 16       135       ₹6.12 billion (US$89 million)
 17       342     ₹44.68 billion (US$650 million)
 18       852     ₹65.62 billion (US$950 million)
 19       NaN     ₹38.11 billion (US$550 million)
 20  11 (+19)                                 NaN
 21      1050    ₹205.81 billion (US$3.0 billion)

                                      5          6
 0                         Total Assets  Ref/Notes
 1    ₹6.01467 trillion (US$88 billion)        NaN
 2     ₹302.36 billion (US$4.4 billion)        NaN
 3   ₹162.2324 billion (US$2.4 billion)        NaN
 4     ₹312.52 billion (US$4.5 billion)        NaN
 5     ₹240.46 billion (US$3.5 billion)        NaN
 6     ₹123.33 billion (US$1.8 billion)        NaN
 7      ₹1.149 trillion (US$17 billion)        NaN
 8     ₹8.638 trillion (US$130 billion)        NaN
 9    ₹11.242 trillion (US$160 billion)        [1]
 10     ₹1.786 trillion (US$26 billion)        NaN
 11    ₹1.1216 trillion (US$16 billion)        NaN
 12    ₹641.26 billion (US$9.3 billion)        NaN
 13    ₹576.63 billion (US$8.4 billion)        NaN
 14     ₹2.146 trillion (US$31 billion)        NaN
 15    ₹287.32 billion (US$4.2 billion)        NaN
 16       ₹7.7 billion (US$110 million)        NaN
 17    ₹486.74 billion (US$7.1 billion)        NaN
 18     ₹743.12 billion (US$11 billion)        NaN
 19     ₹32.24 billion (US$470 million)        NaN
 20                                 NaN        NaN
 21      ₹2.15 trillion (US$31 billion)        NaN  ,
                             0            1                     2         3  \
 0                   Bank Name  Established           Headquarter  Branches
 1              Allahabad Bank         1865  Kolkata, West Bengal      3245
 2                 Andhra Bank         1923  Hyderabad, Telangana      2803
 3              Bank of Baroda         1908     Vadodara, Gujarat      5481
 4               Bank of India         1906   Mumbai, Maharashtra      5100
 5         Bank of Maharashtra         1935     Pune, Maharashtra      1897
 6                 Canara Bank         1906  Bengaluru, Karnataka      6639
 7       Central Bank of India         1911   Mumbai, Maharashtra      4715
 8            Corporation Bank         1906  Mangalore, Karnataka      2440
 9                   Dena Bank         1938   Mumbai, Maharashtra      1874
 10                Indian Bank         1907   Chennai, Tamil Nadu      2896
 11       Indian Overseas Bank         1937   Chennai, Tamil Nadu      3400
 12                  IDBI Bank         1964   Mumbai, Maharashtra      1995
 13  Oriental Bank of Commerce         1943      Gurgaon, Haryana      1092
 14       Punjab and Sind Bank         1908             New Delhi      1554
 15       Punjab National Bank         1894             New Delhi      6937
 16        State Bank of India         1955   Mumbai, Maharashtra     17170
 17             Syndicate Bank         1925    Manipal, Karnataka     3500+
 18                   UCO Bank         1943  Kolkata, West Bengal     4000+
 19        Union Bank of India         1919   Mumbai, Maharashtra      4214
 20       United Bank of India         1950  Kolkata, West Bengal      2054
 21                Vijaya Bank         1931  Bengaluru, Karnataka      2031

                                    4                                  5  \
 0                           Revenues                       Total Assets
 1   ₹188.85 billion (US$2.7 billion)  ₹2,364.60 billion (US$34 billion)
 2   ₹180.27 billion (US$2.6 billion)  ₹2,221.26 billion (US$32 billion)
 3      ₹422 billion (US$6.1 billion)    ₹6,949 billion (US$100 billion)
 4      ₹418 billion (US$6.1 billion)     ₹6,100 billion (US$89 billion)
 5   ₹130.53 billion (US$1.9 billion)     ₹1,610 billion (US$23 billion)
 6    ₹489.4 billion (US$7.1 billion)     ₹5,530 billion (US$80 billion)
 7      ₹259 billion (US$3.8 billion)     ₹3,055 billion (US$44 billion)
 8   ₹194.12 billion (US$2.8 billion)     ₹2,349 billion (US$34 billion)
 9   ₹106.45 billion (US$1.5 billion)     ₹1,335 billion (US$19 billion)
 10   ₹216.9 billion (US$3.2 billion)     ₹3,648 billion (US$53 billion)
 11   ₹235.2 billion (US$3.4 billion)     ₹2,745 billion (US$40 billion)
 12  ₹280.43 billion (US$4.1 billion)     ₹3,744 billion (US$54 billion)
 13   ₹200.6 billion (US$2.9 billion)   ₹2,375.4 billion (US$35 billion)
 14   ₹87.44 billion (US$1.3 billion)   ₹1,025.8 billion (US$15 billion)
 15  ₹474.25 billion (US$6.9 billion)     ₹6,674 billion (US$97 billion)
 16    ₹2.11 trillion (US$31 billion)   ₹34.45 trillion (US$500 billion)
 17   ₹69.13 billion (US$1.0 billion)     ₹2,990 billion (US$44 billion)
 18  ₹185.61 billion (US$2.7 billion)   ₹2,448.9 billion (US$36 billion)
 19     ₹322 billion (US$4.7 billion)     ₹4,047 billion (US$59 billion)
 20   ₹99.37 billion (US$1.4 billion)     ₹1,230 billion (US$18 billion)
 21   ₹123.8 billion (US$1.8 billion)     ₹1,549 billion (US$23 billion)

             6
 0   Ref/Notes
 1         NaN
 2         NaN
 3         NaN
 4         NaN
 5         NaN
 6         NaN
 7         NaN
 8         NaN
 9         NaN
 10        NaN
 11        NaN
 12        NaN
 13        NaN
 14        NaN
 15        NaN
 16        [2]
 17        NaN
 18        NaN
 19        NaN
 20        NaN
 21        NaN  ,
                                                    0  \
 0  Andhra Pradesh Andhra Pragathi Grameena Bank C...

                                                    1  \
 0  Jharkhand Jharkhand Gramin Bank Vananchal Gram...

                                                    2  \
 0  Mizoram Mizoram Rural Bank Nagaland Nagaland R...

                                                    3
 0  Tripura Tripura Gramin Bank Uttar Pradesh Sarv...  ]

In [17]:
type(data)

list